__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_1 (InputLayer)            (None, 320, 1)       0                                            
__________________________________________________________________________________________________
conv1_1 (Conv1D)                (None, 54, 48)       1584        input_1[0][0]                    
__________________________________________________________________________________________________
batch_normalization_1 (BatchNor (None, 54, 48)       192         conv1_1[0][0]                    
__________________________________________________________________________________________________
activation_1 (Activation)       (None, 54, 48)       0           batch_normalization_1[0][0]      
__________________________________________________________________________________________________
conv2_1 (Conv1D)                (None, 18, 48)       18480       activation_1[0][0]               
__________________________________________________________________________________________________
batch_normalization_2 (BatchNor (None, 18, 48)       192         conv2_1[0][0]                    
__________________________________________________________________________________________________
activation_2 (Activation)       (None, 18, 48)       0           batch_normalization_2[0][0]      
__________________________________________________________________________________________________
conv2_2 (Conv1D)                (None, 18, 48)       18480       activation_2[0][0]               
__________________________________________________________________________________________________
batch_normalization_3 (BatchNor (None, 18, 48)       192         conv2_2[0][0]                    
__________________________________________________________________________________________________
max_pooling1d_1 (MaxPooling1D)  (None, 18, 48)       0           activation_1[0][0]               
__________________________________________________________________________________________________
add_1 (Add)                     (None, 18, 48)       0           batch_normalization_3[0][0]      
                                                                 max_pooling1d_1[0][0]            
__________________________________________________________________________________________________
activation_3 (Activation)       (None, 18, 48)       0           add_1[0][0]                      
__________________________________________________________________________________________________
conv2_3 (Conv1D)                (None, 18, 48)       18480       activation_3[0][0]               
__________________________________________________________________________________________________
batch_normalization_4 (BatchNor (None, 18, 48)       192         conv2_3[0][0]                    
__________________________________________________________________________________________________
activation_4 (Activation)       (None, 18, 48)       0           batch_normalization_4[0][0]      
__________________________________________________________________________________________________
conv2_4 (Conv1D)                (None, 18, 48)       18480       activation_4[0][0]               
__________________________________________________________________________________________________
batch_normalization_5 (BatchNor (None, 18, 48)       192         conv2_4[0][0]                    
__________________________________________________________________________________________________
add_2 (Add)                     (None, 18, 48)       0           batch_normalization_5[0][0]      
                                                                 activation_3[0][0]               
__________________________________________________________________________________________________
activation_5 (Activation)       (None, 18, 48)       0           add_2[0][0]                      
__________________________________________________________________________________________________
conv2_5 (Conv1D)                (None, 18, 48)       18480       activation_5[0][0]               
__________________________________________________________________________________________________
batch_normalization_6 (BatchNor (None, 18, 48)       192         conv2_5[0][0]                    
__________________________________________________________________________________________________
activation_6 (Activation)       (None, 18, 48)       0           batch_normalization_6[0][0]      
__________________________________________________________________________________________________
conv2_6 (Conv1D)                (None, 18, 48)       18480       activation_6[0][0]               
__________________________________________________________________________________________________
batch_normalization_7 (BatchNor (None, 18, 48)       192         conv2_6[0][0]                    
__________________________________________________________________________________________________
add_3 (Add)                     (None, 18, 48)       0           batch_normalization_7[0][0]      
                                                                 activation_5[0][0]               
__________________________________________________________________________________________________
activation_7 (Activation)       (None, 18, 48)       0           add_3[0][0]                      
__________________________________________________________________________________________________
global_average_pooling1d_1 (Glo (None, 48)           0           activation_7[0][0]               
__________________________________________________________________________________________________
dense_1 (Dense)                 (None, 3)            147         global_average_pooling1d_1[0][0] 
==================================================================================================
Total params: 113,955
Trainable params: 113,283
Non-trainable params: 672
__________________________________________________________________________________________________
